
      *PROGRAM TABLE 
       01 PROGRAM-TBL-RTN OCCURS 20 TIMES.
               10 PROGRAM-CODE-TBL-WS  PIC X(5).
               10 PROGRAM-NAME-TBL-WS  PIC X(20).
