      *=================================================================
      *COURSE:CST8283 BUSINESS PROGRAMMING
      *PROFESSOR:MEL SANSCHAGRIN
      *GROUP MEMBERS: WEI YU
      *DESCRIPTION:
      *THIS PROGRAM DECLARE THE STRUCTURE OF THE PROGRAM TABLE
      *DATE-WRITTEN.03-DEC-2020.
      *DATE-COMPILED.03-DEC-2020.
      *=================================================================
      *PROGRAM TABLE 
       01 PROGRAM-TBL-RTN OCCURS 20 TIMES.
               10 PROGRAM-CODE-TBL-WS  PIC X(5).
               10 PROGRAM-NAME-TBL-WS  PIC X(20).
