program-id. Project2 as "Project2".

        AUTHOR. Ziyin Yan,Weixin Wang.
        DATE-WRITTEN. 2020-11-30.

        ENVIRONMENT DIVISION.
        INPUT-OUTPUT SECTION.
        FILE-CONTROL.
        SELECT STUDENT-FILE
        ASSIGN TO "E:\STUFILE.TXT"
        ORGANIZATION IS LINE SEQUENTIAL.

        SELECT STUDENT-REPORT
        ASSIGN TO "E:\STURPT.TXT"
        ORGANIZATION IS LINE SEQUENTIAL.

        DATA DIVISION.
        FILE SECTION.
        FD STUDENT-FILE.
        01  STUDENT-RECORD-IN.
        05  STUDENT-NAME        PIC X(20).
        05  STUDENT-NUMBER      PIC 9(9).
        05  PROGRAM-NUMBER      PIC X(3).
        05  MIDTERM-MARK        PIC 9(3).
        05  FINAL-EXAM-MARK     PIC 9(3).
        05  PROJECT-MARK        PIC 9(3).
        05  LAB-MARK            PIC 9(3).

        FD  STUDENT-REPORT.
        01  STUDENT-REPORT-OUT      PIC  X(48).

        WORKING-STORAGE SECTION.

        01  COLUMN-HEADER.
        05  FILLER        PIC X(2)    VALUE   SPACES.
        05  FILLER        PIC X(20)   VALUE   "NAME".
        05  FILLER        PIC X(4)    VALUE   SPACES.
        05  FILLER        PIC X(7)    VALUE   "PROGRAM".
        05  FILLER        PIC X(4)    VALUE   SPACES.
        05  FILLER        PIC X(7)    VALUE   "AVERAGE".

        01  STUDENT-DETAIL-LINE.
        05  FILLER              PIC X(2)    VALUE   SPACES.
        05  STUDENT-NAME-OUT    PIC X(20).
        05  FILLER              PIC X(8)   VALUE   SPACES.
        05  PROGRAM-NUMBER-OUT  PIC X(3).
        05  FILLER              PIC X(4)    VALUE   SPACES.
        05  STUDENT-AVERAGE-OUT PIC 9(3).

        01  GRADE-AVERAGE.
        05  STUDENT-AVERAGE     PIC 9(3).

        01  COUNTERS.
        05  FILLER      PIC X(14)	VALUE "RECORDS READ  ".
        05  RECORDS-IN  PIC 9(3).
        05  FILLER      PIC X(19)	VALUE "  RECORDS WRITTEN  ".
        05  RECORDS-OUT PIC 9(3).

        01  EOF-FLAG-CONTROL.
        05  EOF-FLAG    PIC X(1)  VALUE "N".


        PROCEDURE DIVISION.

        100-CREATE-STUDENT-REPORT.
        PERFORM 201-INITIATE-CREATE-STUDENT-REPORT.
        PERFORM 202-CREATE-STUDENT-REPORT
        UNTIL EOF-FLAG = "Y".
        PERFORM 203-TERMINATE-CREATE-STUDENT-REPORT.
        STOP RUN.

        201-INITIATE-CREATE-STUDENT-REPORT.
        PERFORM  701-OPEN-STUDENT-FILE.
        PERFORM  702-WRITE-COLUMN-HEADER.
        PERFORM  703-READ-STUDENT-RECORD.
        PERFORM  704-INITIALIZE-READ-WRITE-COUNTS.

        202-CREATE-STUDENT-REPORT.
        PERFORM  705-CALCULATE-STUDENT-AVERAGE.
        PERFORM  706-WRITE-DETAIL-LINES.
        PERFORM  703-READ-STUDENT-RECORD.


        203-TERMINATE-CREATE-STUDENT-REPORT.
        PERFORM  707-DISPLAY-AUDIT-COUNTERS.
        PERFORM  708-WRITE-AUDIT-COUNTERS-TO-FILE.
        PERFORM  709-CLOSE-STUDENT-FILE.

        701-OPEN-STUDENT-FILE.
        OPEN    INPUT STUDENT-FILE
        OPEN    OUTPUT STUDENT-REPORT.

        702-WRITE-COLUMN-HEADER.
        WRITE  STUDENT-REPORT-OUT
        FROM  COLUMN-HEADER.

        703-READ-STUDENT-RECORD.
        READ STUDENT-FILE
        AT END  MOVE "Y" TO EOF-FLAG.
        ADD 1 TO RECORDS-IN.

        704-INITIALIZE-READ-WRITE-COUNTS.
        INITIALIZE  RECORDS-IN
        RECORDS-OUT.

        705-CALCULATE-STUDENT-AVERAGE.
        COMPUTE STUDENT-AVERAGE =
        MIDTERM-MARK * 0.35 + FINAL-EXAM-MARK * 0.40 +
        PROJECT-MARK * 0.20 + LAB-MARK * 0.05.

        706-WRITE-DETAIL-LINES.
        MOVE STUDENT-NAME TO STUDENT-NAME-OUT.
        MOVE PROGRAM-NUMBER TO PROGRAM-NUMBER-OUT.
        MOVE STUDENT-AVERAGE TO STUDENT-AVERAGE-OUT.
        WRITE STUDENT-REPORT-OUT
        FROM STUDENT-DETAIL-LINE.

        ADD 1 TO RECORDS-OUT.

        707-DISPLAY-AUDIT-COUNTERS.
        DISPLAY COUNTERS.

        708-WRITE-AUDIT-COUNTERS-TO-FILE.
        MOVE RECORDS-IN TO RECORDS-IN.
        MOVE RECORDS-OUT TO RECORDS-OUT.
        WRITE STUDENT-REPORT-OUT
        FROM COUNTERS.

        709-CLOSE-STUDENT-FILE.
        CLOSE STUDENT-FILE.
        CLOSE STUDENT-REPORT.

        end program Project2.
